workstation/openfoam-master-tutorials/tutorials/combustion/fireFoam/LES/simplePMMApanel/0.orig/panelRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    panel_top
    {
        type            fixedValue;
        value           uniform 298.15;
    }

    panel_side
    {
        type            empty;
    }

    region0_to_panelRegion_panel
    {
        type            fixedIncidentRadiation;
        kappaMethod     solidThermo;
        kappa           none;
        qrIncident      uniform 60000.0;   //W
        value           uniform 298.15;
    }
}


// ************************************************************************* //
