workstation/openfoam-master-tutorials/tutorials/combustion/fireFoam/LES/simplePMMApanel/system/panelRegion/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    h
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }

    "Yi"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    "(rho|rhot)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    };

    thermo:rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    };
}

SIMPLE
{
    nNonOrthCorr    0;
}

relaxationFactors
{
    equations
    {
        h               1;
    }
}


// ************************************************************************* //
